iotsmartsys/IoTSmartLink15.4/coordinator_154/test_apps/device_registry_test/sdkconfig.defaults
# device_registry drives storage through its seam. This test app targets a physical ESP32-C3;
# cases that require the production NVS adapter still link nvs_flash explicitly.
CONFIG_IDF_TARGET="esp32c3"
